EDT/УТ/src/Documents/КорректировкаСтатусовСкладскогоУчета_КУдалению/КорректировкаСтатусовСкладскогоУчета_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаСтатусовСкладскогоУчета_КУдалению</name>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыСкладскогоУчета/СтатусыСкладскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыСкладскогоУчета</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусСкладскогоУчета</name>
    <type>
      <types>CatalogRef.СтатусыСкладскогоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/КорректировкаСтатусовСкладскогоУчета_КУдалению/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

    // регистр СтатусыСкладскогоУчета
    Движения.СтатусыСкладскогоУчета.Записывать = Истина;
    Движения.СтатусыСкладскогоУчета.Очистить();
    Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
        Движение = Движения.СтатусыСкладскогоУчета.Добавить();
        Движение.Период = Дата;
        Движение.Заказ = ТекСтрокаЗаказы.Заказ;
        Движение.СтатусСкладскогоУчета = СтатусСкладскогоУчета;
        Движение.ТипЗаказа = ТекСтрокаЗаказы.ТипЗаказа;
    КонецЦикла;

    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
